coupling/tests/build_foam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            movingWallVelocity;
        value           uniform (0.5 0 0);
    }

    fixedWall
    {
        type            noSlip;
    }

    front
    {
        type            cyclic;
    }
    
    back
    {
        type            cyclic;
    }
    
    left
    {
        type            cyclic;
    }
    
    right
    {
        type            cyclic;
    }
    
    fronti
    {
        type            fixedValue;
        value           nonuniform ((0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0));
    }
    
    backi
    {
        type            fixedValue;
        value           nonuniform ((0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0)
        			(0. 0.1 0) (0. 0.2 0) (0. 0.1 0) (0. 0.2 0));
    }
    
    lefti
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    
    righti
    {
        type            fixedValue;
        value           uniform (0.1 0. 0.);
    }
    
    topi
    {
        type            fixedValue;
        value           uniform (0. 0.1 0);
    }
    
    buttomi
    {
        type            fixedValue;
        value           uniform (0. 0.1 0);
    }
    
    
}

// ************************************************************************* //
